#include "unp.h"

void main_menu()
{
	printf("========================================================\n");
	printf("|							|\n");
	printf("|							|\n");
	printf("|		1.学生					|\n");
	printf("|		2.教师					|\n");
	printf("|		3.管理员				|\n");
	printf("|		4.退出					|\n");
	printf("|							|\n");
	printf("|							|\n");
	printf("========================================================\n");
	printf("\n请选择...	\n");
}

void student_menu()
{
	printf("========================================================\n");
	printf("|							|\n");
	printf("|	你是学生				|\n");
	printf("|							|\n");
	printf("|		1.注册					|\n");
	printf("|		2.登录					|\n");
	printf("|		3.退出					|\n");
	printf("|							|\n");
	printf("|							|\n");
	printf("========================================================\n");
	printf("\n请选择...	\n");
}

void teacher_menu()
{
	printf("========================================================\n");
	printf("|							|\n");
	printf("|	你是教师				|\n");
	printf("|							|\n");
	printf("|		1.注册					|\n");
	printf("|		2.登录					|\n");
	printf("|		3.退出					|\n");
	printf("|							|\n");
	printf("|							|\n");
	printf("========================================================\n");
	printf("\n请选择...	\n");

}

void root_menu()
{

	printf("========================================================\n");
	printf("|							|\n");
	printf("|	你是管理员				|\n");
	printf("|							|\n");
	printf("|		1.注册					|\n");
	printf("|		2.登录					|\n");
	printf("|		3.退出					|\n");
	printf("|							|\n");
	printf("|							|\n");
	printf("========================================================\n");
	printf("\n请选择...	\n");
}


void student_after_login_menu()
{
	printf("========================================================\n");
	printf("|							|\n");
	printf("|	欢迎你				|\n");
	printf("|							|\n");
	printf("|		1.查看基本信息					|\n");
	printf("|		2.修改密码					|\n");
	printf("|		3.退出					|\n");
	printf("|							|\n");
	printf("|							|\n");
	printf("========================================================\n");
	printf("\n请选择...	\n");

}
